УправлениеВетеринарнойКлиникой/src/Documents/Осмотр/Осмотр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Осмотр</name>
  <basedOn>Document.ЗаписьНаПрием</basedOn>
  <registerRecords>InformationRegister.МедицинскиеКарты</registerRecords>
  <attributes>
    <name>ЗаписьНаПрием</name>
    <type>
      <types>DocumentRef.ЗаписьНаПрием</types>
    </type>
  </attributes>
  <attributes>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Хозяин</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОсмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Жалобы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееСостояние</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диагноз</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОсмотра</name>
    <type>
      <types>EnumRef.СтатусыОсмотра</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Дозировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПрименения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказанныеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/InformationRegisters/МедицинскиеКарты/МедицинскиеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МедицинскиеКарты</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Диагноз</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Жалобы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Назначения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Осмотр</name>
    <type>
      <types>DocumentRef.Осмотр</types>
    </type>
  </resources>
  <dimensions>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеВетеринарнойКлиникой/src/Documents/ЗаписьНаПрием/ЗаписьНаПрием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьНаПрием</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Питомец</name>
    <type>
      <types>CatalogRef.Питомцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <comment>В минутах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаписи</name>
    <type>
      <types>EnumRef.СтатусыЗаписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/Documents/Осмотр/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ЗаписьНаПрием <> Неопределено Тогда
		ЗаполнитьДанныеИзЗаписиНаПрием();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗаписьНаПриемПриИзменении(Элемент)
	ЗаполнитьДанныеИзЗаписиНаПрием();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПосмотретьМедКарту(Команда)
    // Проверяем, что питомец выбран в документе
    Если Объект.Питомец = Неопределено Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Выберите питомца в документе!";
        Сообщение.Сообщить();
        Возврат;
    КонецЕсли;
    
    // Формируем параметры для формы регистра
    Структура = Новый Структура;
    Структура.Вставить("Питомец", Объект.Питомец); // Передаем ссылку на питомца
    
    // Открываем форму регистра с отбором
    Попытка
        Форма = ПолучитьФорму("РегистрСведений.МедицинскиеКарты.Форма.ФормаСписка", Структура);
        Форма.Открыть();
    Исключение
    	Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Ошибка открытия формы медкарты";
        Сообщение.Сообщить();
        
    КонецПопытки;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗаполнитьДанныеИзЗаписиНаПрием()
	
	Если Объект.ЗаписьНаПрием = Неопределено Тогда
		
		Объект.Врач = Неопределено;
		Объект.Питомец = Неопределено;
		Объект.Хозяин = Неопределено;
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписи = ПолучитьДанныеИзЗаписиНаПрием(Объект.ЗаписьНаПрием);
	
	Если ДанныеЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Врач = ДанныеЗаписи.Врач;
	Объект.Питомец = ДанныеЗаписи.Питомец;
	Объект.Хозяин = ДанныеЗаписи.Клиент;
	
КонецПроцедуры
&НаСервере
Функция ПолучитьДанныеИзЗаписиНаПрием(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаписьНаПрием.Клиент КАК Клиент,
		|	ЗаписьНаПрием.Питомец КАК Питомец,
		|	ЗаписьНаПрием.Врач КАК Врач
		|ИЗ
		|	Документ.ЗаписьНаПрием КАК ЗаписьНаПрием
		|ГДЕ
		|	ЗаписьНаПрием.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Данные = Новый Структура;
        Данные.Вставить("Врач", Выборка.Врач);
        Данные.Вставить("Питомец", Выборка.Питомец);
        Данные.Вставить("Клиент", Выборка.Клиент);
        Возврат Данные;
	Иначе
		Возврат Неопределено
	КонецЕсли;

КонецФункции

#КонецОбласти
